aaron-bond.better-comments
akamud.vscode-theme-onedark
alefragnani.bookmarks
alefragnani.project-manager
amazonwebservices.aws-toolkit-vscode
amazonwebservices.codewhisperer-for-command-line-companion
azemoh.one-monokai
charliermarsh.ruff
christian-kohler.npm-intellisense
codezombiech.gitignore
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.git-extension-pack
donjayamanne.githistory
donjayamanne.python-environment-manager
eamodio.gitlens
formulahendry.code-runner
foxundermoon.shell-format
github.copilot
github.copilot-chat
github.github-vscode-theme
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
grapecity.gc-excelviewer
gruntfuggly.todo-tree
hbenl.vscode-test-explorer
huggingface.huggingface-vscode
iterative.dvc
jeremyfunk.hidefiles
julialang.language-julia
kevinrose.vsc-python-indent
littlefoxteam.vscode-python-test-adapter
matangover.mypy
mechatroner.rainbow-csv
mhutchie.git-graph
mikhail-arkhipov.r
mkxml.vscode-filesize
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.azure-repos
ms-vscode.live-server
ms-vscode.remote-repositories
ms-vscode.test-adapter-converter
ms-vsliveshare.vsliveshare
njpwerner.autodocstring
njqdev.vscode-python-typehint
oderwat.indent-rainbow
orhunulusahin.praatvscode
pkief.material-icon-theme
quarto.quarto
rdebugger.r-debugger
redhat.vscode-yaml
reditorsupport.r
ryu1kn.partial-diff
shd101wyy.markdown-preview-enhanced
sourcery.sourcery
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
uctakeoff.vscode-counter
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
yzane.markdown-pdf
zainchen.json
ziyasal.vscode-open-in-github
